/*----------------------------------------------------------------
// Copyright (C) 2014-2015 上海迪亮信息科技有限公司 版权所有。 
// 文件名：OperateEnum.cs
// 文件功能描述：操作枚举。
// 创建人：pekah.chow
// 创建时间： 2014-04-23
----------------------------------------------------------------*/

using System;
using System.Collections.Generic;
using System.Text;

namespace NFMT.Common
{
    /// <summary>
    /// 操作枚举
    /// </summary>
    public enum OperateEnum
    {
        查询 = 260,
        录入 = 261,
        修改 = 262,
        提交审核 = 263,
        撤返 = 264,       
        冻结 = 265,
        解除冻结 = 266,
        作废 = 267,
        关闭 = 268,
        执行完成 = 269,
        确认完成撤销 = 271,
        确认完成 = 274,
        执行完成撤销 = 275,
        交单 = 281,
        银行承兑 = 283,
        单据退回 = 284
    }
}
