using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NFMT.WorkFlow
{
    public enum MasterEnum
    {
        信用证审核 = 1,
        合约审核 = 2,
        子合约审核 = 3,
        入库登记审核 = 4,
        质押申请审核 = 5,
        出库申请审核 = 6,
        质押审核 = 7,
        出库审核 = 8,
        收款登记审核 = 9,
        合约收款分配 = 10,
        合约付款申请 = 11,
        库存收款分配 = 12,
        库存付款申请 = 13,
        公司收款分配 = 14,
        财务付款关联合约审核 = 15,
        财务付款关联库存审核 = 16,
        财务发票审核 = 17,
        回购申请审核 = 18,
        回购审核 = 19,
        直接终票审核 = 20,
        价外票审核 = 21,
        点价申请审核 = 22,
        点价审核 = 23,
        集团审核 = 24,
        企业审核 = 25,
        部门审核 = 26,
        员工审核 = 27,
        角色审核 = 28,
        联系人审核 = 29,
        财务发票分配审核 = 30,
        止损申请审核 = 31,
        止损审核 = 32,
        拆单审核 = 33,
        报关申请审核 = 34,
        报关审核 = 35,
        移库申请审核 = 36,
        移库审核 = 37,
        入库分配审核 = 38,
        临票审核 = 40,
        价外票付款申请审核 = 41,
        库存净重回执审核 = 42,
        制单指令审核 = 43,
        制单审核 = 44,
        付款申请 = 47,
        采购主子合约审核 = 48,
        客户审核 = 49,
        价格确认单审核 = 50,
        销售合约审核 = 51,
        发票申请审核 = 52,
        利息结算审核 = 54,
        质押申请单审核 = 55,
        赎回申请单审核 = 56,
        预入库审核 = 57,
        预入库转正式审核 = 58
    }
}
